In [1]:
import pandas as pd
import numpy as np

In [4]:
names1881 = pd.read_csv("yob1881.txt", names=["Name", "Sex", "Births"])

In [5]:
names1881

           Name Sex  Births
0          Mary   F    6919
1          Anna   F    2698
2          Emma   F    2034
3     Elizabeth   F    1852
4      Margaret   F    1658
...         ...  ..     ...
1930     Wiliam   M       5
1931     Wilton   M       5
1932       Wing   M       5
1933       Wood   M       5
1934     Wright   M       5

[1935 rows x 3 columns]

In [12]:
names1881.groupby("Sex")["Births"].sum()

Sex
F     91955
M    100748
Name: Births, dtype: int64